export default function About() {
  return (
    <div>
      <section className="max-w-5xl mx-auto px-4 py-8">
        {/* Title */}
        <h2 className="text-2xl font-bold mb-4 text-gray-800">
          বছিরননেছা উচ্চ বিদ্যালয়
        </h2>

        {/* Intro Paragraph */}
        <p className="text-gray-700 leading-relaxed mb-6">
          বছিরননেছা উচ্চ বিদ্যালয় (ইংরেজি: Basirannesa High School) হচ্ছে
          বাংলাদেশের মুন্সীগঞ্জ সদর উপজেলার রামপাল ইউনিয়নে অবস্থিত একটি
          মাধ্যমিক বিদ্যালয়। বিদ্যালয়টি প্রতিষ্ঠিত হয়েছিলো ১৯৭২ সালে।
        </p>

        {/* History */}
        <h3 className="text-xl font-semibold mb-2 text-gray-800">ইতিহাস</h3>
        <p className="text-gray-700 leading-relaxed mb-6">
          ১৯৭২ সালে সাবেক তথ্যমন্ত্রী এম শামসুল ইসলাম সাহেবের শ্রদ্ধেয় পিতা
          মরহুম হাজী ওসমান গণি সাহেব বছিরননেছা বালিকা উচ্চ বিদ্যালয় প্রতিষ্ঠা
          করেন। এতে অত্র এলাকায় মেয়েদের শিক্ষার পথ সুগম হয়। শিক্ষা বিস্তারের
          পথ আরো সুগম করতে সাবেক তথ্যমন্ত্রী এম শামসুল ইসলাম সাহেবের ঐকামিত্মক
          প্রচেষ্ঠায় বিদ্যালয়টি শ্রী বৃদ্ধি পায়। পরবর্তীতে ২০০৬ সালে সহ
          শিক্ষা ব্যবস্থা করা হয়। তথ্য প্রযুক্তির যুগে কম্পিউটার শিক্ষাহীন
          ব্যক্তি আশিক্ষিত। এ সত্যকে সামনে রেখে বিদ্যালয়ে কম্পিউটার শিক্ষার
          জন্য কম্পিউটার ল্যাব স্থাপন করা হয়।
        </p>

        {/* Academic Programs */}
        <h3 className="text-xl font-semibold mb-2 text-gray-800">
          শিক্ষা কার্যক্রম
        </h3>
        <p className="text-gray-700 leading-relaxed">
          শুরুতে বিদ্যালয়টিতে শুধুমাত্র মেয়েদের পড়ার সুযোগ ছিল। পরবর্তীতে
          ছেলে মেয়ে উভয়ের অধ্যয়নের সুযোগ হয়। বর্তমানে এ বিদ্যালয়ে ৬ষ্ঠ থেকে
          ১০ম শ্রেণি পর্যন্ত শিক্ষাদান করা হয়।
        </p>
        <h3 className="text-xl font-semibold mb-2 text-gray-800">ল্যাবরেটরি</h3>
        <p className="text-gray-700 leading-relaxed">
          পদার্থবিজ্ঞান, রসায়নবিজ্ঞান, জীববিজ্ঞান, কম্পিউটার ইত্যাদি বিষয়ে
          শিক্ষার্থীদের গবেষণার জন্য বিদ্যালয়ে ল্যাব রয়েছে। এসব ল্যাবে বহু
          মূল্যবান যন্ত্রপাতি রয়েছে। শিক্ষার্থীরা এসব উপকরণ ব্যবহার করে
          ব্যবহারিক জ্ঞান শিখতে পারে।
        </p>
        <h3 className="text-xl font-semibold mb-2 text-gray-800">গ্রন্থাগার</h3>
        <p className="text-gray-700 leading-relaxed">
          বিদ্যালয়টিতে একটি বড় গ্রন্থাগার রয়েছে। এতে রয়েছে বিভিন্ন ধরনের
          নামী-দামী কয়েক হাজার বই। শিক্ষার্থীরা এখানে স্বাচ্ছন্দ্যে বসে পড়তে
          পারে এবং তাদের পছন্দের বই নির্দিষ্ট সময়ের জন্য বাড়ি নিয়ে যেতে পারে।
        </p>
      </section>
    </div>
  );
}
